Emacs.org
#+PROPERTY: header-args:emacs-lisp :tangle ./.emacs.d/init.el
#+title Emacs Configuration

Use ~M-x org-babel-tangle~ to export this file.

* Installation

- Install fonts with ~M-x all-the-icons-install-fonts~

* Per System Settings
These are the variables that are expected to be overwritten by system local settings.

#+begin_src emacs-lisp
;; Font Settings
(defvar cjc/default-font-mono "Roboto Mono")
(defvar cjc/default-font-variable "Roboto")
(defvar cjc/default-font-height 150)

;; Theme Settings
(defvar cjc/default-dark-theme 'doom-challenger-deep)
(defvar cjc/default-light-theme 'doom-solarized-light)

;; Org Settings
(defvar cjc/default-org-notes-dir (expand-file-name "~/org"))
#+end_src

** Systems
*** Template

#+begin_src emacs-lisp :tangle ./.emacs.d/hosts/template.el
(setq cjc/default-font-mono "Roboto Mono")
(setq cjc/default-font-variable "Roboto")
(setq cjc/default-font-height 150)

;; Theme Settings
(setq cjc/default-dark-theme 'doom-challenger-deep)
(setq cjc/default-light-theme 'doom-solarized-light)

;; Org Settings
(setq cjc/default-org-notes-dir (expand-file-name "~/org"))
#+end_src

** covertcj-laptop-msi

#+begin_src emacs-lisp :tangle ./.emacs.d/hosts/covertcj-laptop-msi.el
(setq cjc/default-font-mono "CozetteVector")
(setq cjc/default-font-variable "Roboto")
(setq cjc/default-font-height 140)
#+end_src

** Load Local Config

Loads 2 special configuration files:
- ~.emacs.d/hosts/<hostname>.el~
- ~.emacs.d/priv.el~, which is kept out of source control

#+begin_src emacs-lisp
(defvar cjc/host (substring (shell-command-to-string "hostname") 0 -1))
(defvar cjc/hosts-dir "~/.emacs.d/hosts/")
(defvar cjc/host-init-file (concat cjc/hosts-dir cjc/host ".el"))
(defvar cjc/private-init-file "~/.emacs.d/priv.el")

(when (file-exists-p cjc/host-init-file)
  (load cjc/host-init-file))

(when (file-exists-p cjc/private-init-file)
  (load cjc/private-init-file))
#+end_src

* Basic UI Configuration
** Basic Window Settings

#+begin_src emacs-lisp
;; Basic Window Settings ;;
(setq inhibit-startup-message t)

; remove unnecessary ui elements
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)

; pad the edge of the window
(set-fringe-mode 10)

; no more annoying bell noises
(setq visible-bell nil)

; keep the cursor away from the edge, and don't jump around when scrolling
(setq scroll-margin 8)
(setq scroll-conservatively 1)

(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

** Line Numbers

#+begin_src emacs-lisp
;; Line Numbers ;;
; relative line numbers everywhere
(global-display-line-numbers-mode t)
(setq display-line-numbers 'relative)

; show the cursor's current column
(column-number-mode)

; disable line numbers for certain modes
(dolist (mode '(term-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Fonts

#+begin_src emacs-lisp
;; Fonts ;;
(set-face-attribute 'default nil :font cjc/default-font-mono :height cjc/default-font-height)
(set-face-attribute 'fixed-pitch nil :font cjc/default-font-mono :height cjc/default-font-height)
(set-face-attribute 'variable-pitch nil :font cjc/default-font-variable :height cjc/default-font-height)
#+end_src

* Package Management
** Setup Package Archives

#+begin_src emacs-lisp
;; Setup Package Archives
(require 'package)

; setup the package archives and make sure there is a local copy
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src

** Setup use-package

#+begin_src emacs-lisp
;; Setup use-package ;;
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* Temporary / Cache File Management

#+begin_src emacs-lisp
; change the directory that most projects use for temporary/cache files
(setq user-emacs-directory (expand-file-name "~/.cache/emacs"))
(when (not (file-directory-p user-emacs-directory))
  (make-directory user-emacs-directory t))

; don't create lockfiles for modified files
(setq create-lockfiles nil)

; changes the default locations of temp/cache files for common packages
(use-package no-littering
  :config
  ; put auto-save files into the no-littering area
  (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  ; don't put customizations into ~init.el~
  (setq custom-file (no-littering-expand-etc-file-name "custom.el")))
#+end_src

* Keybindings
** Packages
*** Basics

#+begin_src emacs-lisp
;; Basic Keybindings ;;
; let ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src 

*** General

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup)
  (general-create-definer cjc/leader-key
    :states '(normal visual emacs motion)
    :keymaps 'override
    :prefix "SPC"
    :non-normal-prefix "C-SPC"))
#+end_src

*** Which Key

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.5))
#+end_src

*** Evil

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

*** Hydra

#+begin_src emacs-lisp
(use-package hydra
  :after general)
  #+end_src

** Generic Keybinds
All sub-headings will be wrapped in ~with-eval-after-load~.

#+begin_src emacs-lisp
(with-eval-after-load 'general
  (with-eval-after-load 'hydra
#+end_src

*** Buffer Management

#+begin_src emacs-lisp
    (cjc/leader-key
     "b"  '(:ignore b :which-key "buffers")
     "bb" '(counsel-switch-buffer :which-key "switch buffers")
     "bk" '(kill-current-buffer :which-key "kill current buffer")
     "bK" '(kill-buffer :which-key "kill buffer"))
#+end_src

*** Settings Toggles
**** Text Scaling 

#+begin_src emacs-lisp
    (defhydra hydra-scale-text (:timeout 6)
      "scale editor text"
      ("j" text-scale-increase "in")
      ("k" text-scale-decrease "out")
      ("f" nil "finished" :exit t))
#+end_src

**** Theme Toggling

#+begin_src emacs-lisp
      (defun cjc/toggle-themes ()
        "Switches between a list of themes"
        (interactive)
        (let* ((current-theme (nth cjc/theme-index cjc/theme-list))
               (next-index (mod (+ cjc/theme-index 1) (length cjc/theme-list)))
               (next-theme (nth next-index cjc/theme-list)))
          (disable-theme current-theme)
          (message "Theme: %s" next-theme)
          (setq cjc/theme-index next-index)
          (condition-case nil
              (enable-theme next-theme)
            (error (load-theme next-theme t)))))
#+end_src

**** Leader Binds

#+begin_src emacs-lisp
    (cjc/leader-key
      "t" '(:ignore t :which-key "toggle settings")
      "tf" '(hydra-scale-text/body :which-key "font scaling")
      "tt" '(cjc/toggle-themes :which-key "theme")
      "tT" '(counsel-load-theme :which-key "theme"))
#+end_src

*** End with-eval-after-load

#+begin_src emacs-lisp
))
#+end_src

* Theming
** Theme Hook

Runs a hook after the theme is loaded or changed.

#+begin_src emacs-lisp
(defvar after-change-theme-hook nil
  "Hook run after a color theme is loaded using `load-theme' or `enable-theme'.")

(defadvice load-theme (after run-after-change-theme-hook activate)
  "Run `after-change-theme-hook'."
  (run-hooks 'after-change-theme-hook))

(defadvice enable-theme (after run-after-change-theme-hook activate)
  "Run `after-change-theme-hook'."
  (run-hooks 'after-change-theme-hook))
#+end_src

** Icons
These icons are required for ~doom-modeline~.

#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src

** Modeline

#+begin_src emacs-lisp
(use-package doom-modeline
  :init (doom-modeline-mode 1))
#+end_src

** Doom Themes

#+begin_src emacs-lisp
(setq cjc/theme-list
  (list cjc/default-dark-theme
        cjc/default-light-theme))
(setq cjc/theme-index 0)

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold nil
	doom-themes-enable-italic nil)
  (load-theme (car cjc/theme-list) t)
  (doom-themes-org-config))
#+end_src

** Rainbow Delimiters

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Todo Highlights

#+begin_src emacs-lisp
(use-package hl-todo
  :config
  (defun cjc/hl-todo-setup-theme ()
    (setq hl-todo-keyword-faces
      '(("TODO" . (face-foreground 'font-lock-keyword-face))
        ("FIXME" . (face-foreground 'font-lock-keyword-face))))
    (when (or (bound-and-true-p hl-todo-mode)
              (bound-and-true-p global-hl-todo-mode))
      (hl-todo-mode)))

  (cjc/hl-todo-setup-theme)
  (add-hook 'after-change-theme-hook #'cjc/hl-todo-setup-theme t)

  (global-hl-todo-mode))

#+end_src

* Development Packages
