Emacs.org
** Ivy

#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :bind (:map ivy-minibuffer-map
              ("TAB" . ivy-alt-done)
              ("C-j" . ivy-next-line)
              ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
              ("C-k" . ivy-previous-line)
              ("M-k" . ivy-switch-buffer-kill))
  :config
  (setq ivy-on-del-error-function #'ignore)
  (ivy-mode 1))

(use-package counsel
  :config
  (counsel-mode 1))

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1))

(use-package swiper
  :after ivy
  :bind (("C-s" . swiper)))

(use-package ivy-posframe
  :config
  (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-bottom-left)))
  (ivy-posframe-mode 1))

(use-package all-the-icons-ivy
  :init (add-hook 'after-init-hook 'all-the-icons-ivy-setup))
#+end_src

** Git

#+begin_src emacs-lisp
(use-package forge)
(use-package magit
  :config
  (cjc/leader-key
   "g"  '(:ignore g :which-key "git")
   "gs" '(magit-status :which-key "status")
   "gb" '(magit-branch :which-key "branch")
   "gc" '(magit-branch-or-checkout :which-key "branch or checkout")))

(when (eq system-type 'windows-nt)
  (setenv "SSH_ASKPASS" "git-gui--askpass")
  (use-package ssh-agency))
#+end_src

** Projectile

#+begin_src emacs-lisp
(use-package projectile
  :after (general ivy)
  :diminish projectile-mode
  :init
  (setq projectile-project-search-path '())
  (when (file-directory-p "~/dev") (push "~/dev" projectile-project-search-path))
  (when (file-directory-p "~/work") (push "~/work" projectile-project-search-path))

  (setq projectile-completion-system 'ivy)

  :config
  (projectile-mode 1)
  (cjc/leader-key
    "p" '(:keymap projectile-command-map :wk "projectile")))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))
#+end_src

** LSP

#+begin_src emacs-lisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :config
  (cjc/leader-key
    "l" '(:keymap lsp-command-map :wk "lsp"))
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode))
#+end_src

** Company

#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (prog-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
          ("<tab>" . company-complete-selection))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.1))

(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

** Languages
*** Typescript / Javascript

#+begin_src emacs-lisp
(use-package typescript-mode
  :mode "\\.[jt]sx?\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
#+end_src

* Other Packages
** Helpful

#+begin_src emacs-lisp
(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key)
  :init
  (cjc/leader-key
     "h"  '(:ignore h :which-key "help")
     "hf" '(counsel-describe-function :which-key "functions")
     "hv" '(counsel-describe-variable :which-key "variables")
     "hc" '(helpful-command :which-key "commands")
     "hk" '(helpful-key :which-key "keys")))
#+end_src

* Terminals
** Basic Settings
#+begin_src emacs-lisp
(defun cjc/all-term-mode-hook ()
  (setq scroll-margin 0))

(add-hook 'eshell-mode-hook 'cjc/all-term-mode-hook)
#+end_src

* Org Mode
** Org

All sub-headings in this section are contained within the top level use-package.

#+begin_src emacs-lisp
(setq cjc/org-index-file (concat (file-name-as-directory cjc/default-org-notes-dir) "000 Index.org")
      cjc/org-backlog-file (concat (file-name-as-directory cjc/default-org-notes-dir) "001 Backlog.org")
      cjc/org-calendar-file (concat (file-name-as-directory cjc/default-org-notes-dir) "002 Calendar.org")
      cjc/org-archive-file (concat (file-name-as-directory cjc/default-org-notes-dir) "003 Archive.org")
      cjc/org-contacts-file (concat (file-name-as-directory cjc/default-org-notes-dir) "004 Contacts.org"))

(setq org-directory cjc/default-org-notes-dir)

(use-package org-contacts
  :ensure nil
  :after org
  :custom (org-contacts-files (list cjc/org-contacts-file)))

(use-package org
  :ensure org-plus-contrib
  :hook (org-mode . cjc/org-mode-setup)
  :config
#+end_src

*** Basic Settings

#+begin_src emacs-lisp
  ;; Basic Settings ;;
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t)

  (with-eval-after-load 'evil
      (evil-define-key '(normal visual) outline-mode-map (kbd "<tab>") #'org-cycle)
      (evil-define-key '(normal visual) outline-mode-map (kbd "TAB") #'org-cycle))
#+end_src

*** Agenda Settings

#+begin_src emacs-lisp
  ;; Agenda Settings ;;
  (setq org-agenda-start-with-log-mode t
        org-log-done 'time
        org-log-into-drawer t
        org-agenda-files
        (list cjc/org-backlog-file
              cjc/org-calendar-file
              cjc/org-archive-file
              cjc/org-contacts-file)
        org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "WAIT(w@)" "|" "DONE(d!)" "CANCELLED(c@)")))

  (setq org-refile-targets
    '((cjc/org-archive-file :maxlevel . 1)))

  ; save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)

  ; configure custom agenda views
  ;(setq org-agenda-custom-commands
  ; '(("d" "Dashboard"
  ;   ((agenda "" ((org-deadline-warning-days 7)))
  ;    (todo "TODO+STYLE=\"habit\"" ((org-agenda-overriding-header "Habits")))
  ;    (todo "NEXT"
  ;      ((org-agenda-overriding-header "Next Tasks")))
  ;    (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

  ;  ("n" "Next Tasks"
  ;   ((todo "NEXT"
  ;      ((org-agenda-overriding-header "Next Tasks")))))

  ;  ("h" "Home Tasks" tags-todo "+work")
  ;  ("w" "Work Tasks" tags-todo "+home")
  ;  ("m" "Media" tags-todo "+media")))

  ; default tags
  (setq org-tag-alist
    '((:startgroup)
      ("home" . ?h)
      ("work" . ?w)
      ("play" . ?p)
      (:endgroup)
      ("note" . ?n)
      ("media" . ?m)))
#+end_src

*** Capturing

#+begin_src emacs-lisp
  (defvar cjc/org-contacts-template "* %(org-contacts-template-name) %^g
:PROPERTIES:
:ADDRESS: %^{ADDRESS}
:BIRTHDAY: %^{BIRTHDAY, yyyy-mm-dd}
:EMAIL: %(org-contacts-template-email)
:NOTE: %^{NOTE}
:END:" "Template for org-contacts.")


  (setq org-capture-templates
    `(("t" "Todo" entry (file+headline ,cjc/org-backlog-file "Tasks")
         "** TODO %?\n  %i\n  %a")
      ("e" "Event" entry (file+headline ,cjc/org-calendar-file "Events")
         "** %?\n %i\n  :SCHEDULED: %^T")
      ("c" "Contact" entry (file cjc/org-contacts-file)
         ,cjc/org-contacts-template)))
#+end_src

*** Load Org Babel Languages

#+begin_src emacs-lisp
  ;; Load Org Babel Languages ;;
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)
#+end_src

*** Automatically Tangle Configuration

#+begin_src emacs-lisp
;; Automatically Tangle Configuration ;;
  (defun cjc/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/dev/dotfiles/Emacs.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
  
  (add-hook 'org-mode-hook
            (lambda () (add-hook 'after-save-hook
                               #'cjc/org-babel-tangle-config)))
#+end_src

*** Org Tempo Snippets

#+begin_src emacs-lisp
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
#+end_src

*** Fonts

#+begin_src emacs-lisp
  (defun cjc/org-setup-fonts ()
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
        (set-face-attribute (car face) nil :font "Roboto" :weight 'regular :height (cdr face)))

    ; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

  (add-hook 'after-change-theme-hook #'cjc/org-setup-fonts t)
  (cjc/org-setup-fonts)
#+end_src

