Emacs.org
*** Helper Functions

#+begin_src emacs-lisp
(defun cjc/org-toggle-emphasis ()
  "Toggle hiding/showing of org emphasize markers."
  (interactive)
  (if org-hide-emphasis-markers
      (set-variable 'org-hide-emphasis-markers nil)
    (set-variable 'org-hide-emphasis-markers t))
  (org-mode-restart))
#+end_src

#+begin_src emacs-lisp
(defun cjc/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (setq evil-auto-indent nil))
#+end_src

*** End use-package org

#+begin_src emacs-lisp
)
#+end_src

*** Keybinds

**** Helpers

#+begin_src emacs-lisp
(defun cjc/org-open-index-file ()
  "Opens the index file from the org notes directory"
  (interactive)
  (find-file cjc/org-index-file))
#+end_src
  
#+begin_src emacs-lisp
(cjc/leader-key
  :keymaps 'org-mode-map
  "m" '(:ignore t :which-key "org-mode")
  "me" '(cjc/org-toggle-emphasis :which-key "toggle emphasis"))
  
(cjc/leader-key
  "n" '(:ignore t :which-key "notes")
  "nc" '(org-capture :which-key "capture")
  "nn" '(cjc/org-open-index-file :which-key "open index")
  "na" '(org-agenda :which-key "agenda"))
#+end_src

** Org Superstar

#+begin_src emacs-lisp
(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("❖" "✱" "✹" "✸" "✦" "✧")
        org-superstar-leading-bullet " "))
#+end_src

* Things To Check Out
** org-appear Package
Dynamically shows/hides markup in org mode based on cursor position.

** ivy-posframe
Sticks ivy completion buffers into posframe popout windows

** ivy-rich
Already installed, but make sure it's doing doing something and check out advanced config

** smart-modeline
Alternative to doom-modeline

** consider daviwil style per system settings

